{
    "stages": [
        {
            "id": 1,
            "name": "Общие вопросы для установления контакта с пациентом",
            "questions": [
                { "id": 1, "text": "Как себя чувствуете?" },
                { "id": 2, "text": "Что вас беспокоит?" },
                { "id": 3, "text": "Принимаете ли вы терапию (вообще/ранее назначенную)?" },
                { "id": 4, "text": "Выходите ли вы гулять?" },
                { "id": 5, "text": "Как у вас аппетит?" },
                { "id": 6, "text": "Как у вас с вредными привычками, курите? Или раньше курили. На сколько дней вам хватает или хватало одной пачки сигарет? Какой у вас общий стаж курения?" }
            ]
        },
        {
            "id": 2,
            "name": "Вопросы о приеме назначенной терапии",
            "questions": [
                {"id": 7, "text": "Придерживаетесь ли вы рекомендаций?"},
                {"id": 8, "text": "Принимаете ли вы назначенные препараты?"},
                {"id": 9, "text": "Пропускаете ли прием препаратов или какого отдельного приема? Причина отказа или пропуска приема препарата?"},
                {
                    "id": 10, 
                    "text": "Есть ли у вас сахарный диабет?", 
                    "if": true, 
                    "questions": [
                        {"id": 11, "text": "Есть ли у вас дома глюкометр?"},
                        {"id": 12, "text": "Как часто вы контролирует уровень гликемии?"},
                        {"id": 13, "text": "Какие обычно значения глюкозы крови у вас?"}
                    ]
                },
                {"id": 14, "text": "Принимаете ли вы сейчас препараты, вроде клопидогреля?"},
                {"id": 15, "text": "Вы сами покупаете или вам выдают бесплатно в поликлинике?"}
            ]
        },
        {
            "id": 3,
            "name": "Вопросы о наличии стенокардии",
            "questions": [
                {
                    "id": 16, 
                    "text": "Возникают ли у вас боли в груди при ходьбе, беге, выполнении физической работы?", 
                    "if": true,
                    "questions": [
                        {"id": 17, "text": "Какой характер боли? (давящий, жгучий, колющий)"},
                        {"id": 18, "text": "Боль локализуется только в груди? Или куда-то отдает: В шею? В руку? В спину?В челюсть? В живот? В ногу?"},
                        {"id": 19, "text": "Боли проходят или уменьшаются в покое? При снижении темпа ходьбы или физической работы? Через сколько минут боли купируются/проходят/прекращаются?"},
                        {"id": 20, "text": "Пробовали ли вы использовать нитроглицерин (различные варианты нитратов)? Через сколько минут боли купируются/проходят/прекращаются?"},
                        {"id": 21, "text": "Если после прекращения боли в груди вновь продолжить нагрузку (ходьба, бег, работа и прочее), будет ли возврат подобной боли?"},
                        {"id": 22, "text": "Всегда ли при одних и тех же обстоятельствах повторяются эти боли?"},
                        {"id": 23, "text": "Когда и при каких условиях боли сильнее выражены или возникают чаще (например, на улице, в холодную или ветреную погоду и прочее)"},
                        {"id": 24, "text": "Как часто в день или в неделю или в месяц возникают подобные боли?"},
                        {"id": 25, "text": "Бывают ли подобные боли в покое: днем? в ночное время?"},
                        {"id": 26, "text": "Был ли какой-то период времени, после проведенного лечения, когда загрудинные боли, одышка уменьшились или перестали вас не беспокоили? И когда вновь у вас возобновилась клиника стенокардии?"}
                    ]
                }
            ]
        },
        {
            "id": 4,
            "name": "Вопросы об артериальной гипертензии",
            "questions": [
                {"id": 27, "text": "Измеряете ли вы артериальное давление в домашних условиях?"},
                {"id": 28, "text": "Вы используете автоматический, полуавтоматический, механический тонометр?"},
                {"id": 29, "text": "Какие цифры давления у вас в последнее время?"},
                {
                    "id": 30, 
                    "text": "Бывают ли повышения АД более 140/ ? 160/ ? 180/ ?", 
                    "if": true, 
                    "questions": [
                        {"id": 31, "text": "Эти повышения преимущественно бывают в утренние/дневные/вечерние/ночные часы?"},
                        {"id": 32, "text": "Что вы ощущаете при повышенном АД? Боли в груди? Одышку? Сердцебиение? Головную боль? Эти симптомы при повышенном давлении меняются при нагрузке (ходьбе) и в покое?"},
                        {"id": 33, "text": "Сколько раз Вы перемеряете АД при таких повышенных цифрах?"},
                        {"id": 34, "text": "Что вы делаете при повышенном АД?"},
                        {"id": 35, "text": "Что вы принимаете при повышенном АД?"}
                    ]
                }
            ]
        },
        {
            "id": 5,
            "name": "Вопросы о наличии сердечной недостаточности",
            "questions": [
                {"id": 36, "text": "Возникает ли у вас одышка при ходьбе, беге, выполнении физической работы?"},
                {"id": 37, "text": "Возникает ли у вас сердцебиение при ходьбе, беге, выполнении физической работы?"},
                {"id": 38, "text": "Возникает ли у вас одышка при наклонах вперед, при работе в наклон,  завязывании шнурков?"},
                {"id": 39, "text": "Возникает ли у вас одышка в ночные часы? Можете ли вы спать без подушки на ровной поверхности, то есть без приподнятости головы? Если есть одышка лежа, приходится ли спать сидя?"},
                {"id": 40, "text": "Возникает ли в положении лежа на спине кашель? Если отделяется мокрота, какого она цвета?"},
                {"id": 41, "text": "Бывают или есть ли у вас отеки на голенях, стопах?"},
                {"id": 42, "text": "Вы принимаете мочегонные? Например, фуросемид? Приводит ли этот прием к снижению одышки?"}
            ]
        },
        {
            "id": 6,
            "name": "Вопросы о наличии аритмий сердца",
            "questions": [
                {
                    "id": 43, 
                    "text": "Возникают ли у вас сердцебиение, перебои в груди в покое, при ходьбе, беге, выполнении физической работы?", "if": true,
                    "questions": [
                        {"id": 44, "text": "Сердцебиение начинается постепенно и далее нарастает?"},
                        {"id": 45, "text": "Сердцебиение начинается внезапно и далее ощущается с одной и той же частотой?"},
                        {"id": 46, "text": "Как часто у вас возникают перебои в работе сердца? И как долго продолжаются эти приступы по времени?"},
                        {"id": 47, "text": "Как вы измеряете пульс: на руке, умными часами, тонометром при измерении АД?"},
                        {"id": 48, "text": "Что вы ощущаете при приступе? Появляются ли боли в груди? Одышка? Головокружение? Потери сознания?"},
                        {"id": 49, "text": "Чем снимаете приступ?"},
                        {"id": 50, "text": "Какой препарат в большей степени (самый эффективный) вам помогает?"},
                        {"id": 51, "text": "Что вы испытываете после купирования приступа аритмии?"},
                        {"id": 52, "text": "Вы вызываете Скорую помощь для купирования аритмии?"},
                        {"id": 53, "text": "При измерении пульса отмечали ли вы редкий пульс? Назовите самый редкий пульс в своей жизни, который вы зафиксировали/видели у себя?"},
                        {"id": 54, "text": "Были ли потери сознания? Или предобморочные состояния (почти потеря сознания)?"}
                    ]
                }
            ]
        },
        {
            "id": 7,
            "name": "Вопросы о кровотечениях",
            "questions": [
                {
                    "id": 55, 
                    "text": "Бывают ли у вас кровотечения/кровоточивость?", 
                    "if": true,
                    "questions": [
                        {"id": 56, "text": "Носовые?"},
                        {"id": 57, "text": "Десневые?"},
                        {"id": 58, "text": "Во время рвоты?"},
                        {"id": 59, "text": "В мокроте при кашле?"},
                        {"id": 60, "text": "Есть ли примеси какого-нибудь цвета?"},
                        {"id": 61, "text": "В моче при мочеиспускании?"},
                        {"id": 62, "text": "Цвет мочи?"},
                        {"id": 63, "text": "При дефекации: в кале, в унитазе, на туалетной бумаге?"}
                    ]
                },
                {"id": 64, "text": "Как часто возникают кровотечения у вас?"},
                {"id": 65, "text": "Вы принимаете препараты (кроворазжижающие, обычно требуется уточнение- антииагреганты (аспирин и/или клопидогрель, тикагрелор) и/или антикоагулянты (варфарин, дабигатран, ривароксабан, апиксабан)? Менялась ли терапия этими препаратами (отмена полная, замена, сокращение количества и доз)? Смена терапии связана ли была с имевшимися кровотечениями?"},
                {"id": 66, "text": "Были ли госпитализации по поводу кровотечений? Выполнялось ли переливание крови?"},
                {"id": 67, "text": "Не являетесь ли донором и не сдавали ли кровь в последнее время?"}
            ]
        },
        {
            "id": 8,
            "name": "Вопросы о качестве жизни/общие вопросы",
            "questions": [
                {"id": 68, "text": "Состоите ли вы на учете в поликлинике или частном центре, проводящем длительное амбулаторное наблюдение?"},
                {"id": 69, "text": "Проходите ли диспансеризацию?"},
                {"id": 70, "text": "Проводятся ли вам запланированные обследования (ЭКГ, УЗИ, липидный спектр, глюкоза и прочее более специфичное)?"},
                {"id": 71, "text": "Вы удовлетворены врачами поликлиники/частного центра и самими медицицинскими центрами?"},
                {"id": 72, "text": "После того как вам была поставлен кардиологический диагноз и назначена терапия как поменялась ваша жизнь?"},
                {"id": 73, "text": "Как ваше общее самочувствие в последнее время (день, неделя, месяц и тд)"},
                {"id": 74, "text": "Вы согласны выполнять предписанные назначения по изменению образа жизни и продолжения медикаментозной терапии?"},
                {"id": 75, "text": "Готовы ли вы поменять свое лечение при появлении новых методов лечения?"},
                {"id": 76, "text": "Госпитализации были ли?"},
                {"id": 77, "text": "Проходили ли реабилитацию?"},
                {"id": 78, "text": "Набрали ли вес?"},
                {"id": 79, "text": "Снизился ли вес?"},
                {"id": 80, "text": "Изменился ли аппетит?"},
                {"id": 81, "text": "Дорого ли вам обходится лечение?"},
                {"id": 82, "text": "Получаете ли вы какие-то льготные препараты в поликлинике?"}
            ]
        }
    ]
}